app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def ensure_correct_user
    	@book = Book.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
	def index
		@user = User.find(current_user.id)

		@book_new = Book.new
		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@book = Book.find(params[:id])
		@user = User.find(@book.user_id)

INSERT INTO "books" ("title", "opinion", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test1"], ["opinion", "16:16\r\n"], ["user_id", 1], ["created_at", "2020-05-06 07:16:09.186160"], ["updated_at", "2020-05-06 07:16:09.186160"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
	def create
		@book_new = Book.new(book_params)
		@book_new.user_id = current_user.id
		if @book_new.save
			flash[:notice] = "You have creatad book successfully."
			redirect_to book_path(@book_new)
		else
			@user = User.find(current_user.id)
			@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["opinion", "good fox\r\n"], ["updated_at", "2020-05-06 07:16:52.187446"], ["id", 1]]
---
	def update
		@book = Book.find(params[:id])
		if @book.update(book_params)