app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    @user = User.find(current_user.id)
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "39b0e14a6833f601f93679ca0d884ce53681d5e71660a6c9ef885f796a22"], ["updated_at", "2020-05-07 06:43:51.534592"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)